Revit 2027 API
BuiltInFailures.DimensionFailures.DifferentLabelsInMultiSegmentDim Property
 All segments of a multi-segment dimension must be labeled the same.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DifferentLabelsInMultiSegmentDim { get; }
Public Shared ReadOnly Property DifferentLabelsInMultiSegmentDim As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DifferentLabelsInMultiSegmentDim {
	FailureDefinitionId^ get ();
}
static member DifferentLabelsInMultiSegmentDim : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace